{"data":{"markdownRemark":{"html":"<h2>Preface</h2>\n<p>This post will go over a simple solution to using React refs and changing the style of a ref element.</p>\n<p>Yesterday I ran into an issue where I was submitting a form with all inputs hidden and its values automatically generated. I had an input of type submit that would send the post request form and redirect to that page's results. </p>\n<p>Simple enough, and honestly worked fine as is. </p>\n<p>My issue was that I needed to style it to look like an anchor tag link which does a similar simple get request with parameters in the url. Ok, styling it is easy enough, but my anchor tag turns blue when I hover. My initial solution:\n<code>onMouseOver = {()=>this.input.style.color = '#0000FF'}</code></p>\n<p>This doesn't work. This is referring to the entire class component. I browsed throught the component seeing if I could possibly pinpoint that particularl input element. This might be possible, but I didn't like where this was going. A little google-fu bringing me to...of course...stack overflow quickly made me realize that I should probably look at React Refs. </p>\n<p>I've used React refs before, but following documentation. I've even googled it, and been like \"Yeah, ok, I'll pick this up later\".  Welp, now the time has come. Lets make it work. This is a simple example that I think helps get one's feet wet into refs. </p>\n<p>I am using React v16.4.2. This is important, as the rules have evolved slightly. </p>\n<h2>The How-To</h2>\n<p>Start with constructing the ref initially in the constructor:<br>\n<code>this.formSubmitRef = React.createRef();</code> </p>\n<p>As a whole it'll look something like this: </p>\n<pre><code class=\"language-javascript\">class Taxes extends Component {\n  constructor(props) {\n    super(props);\n    this.formSubmitRef = React.createRef();\n    this.state = {\n      expanded: false\n    };\n  }\n</code></pre>\n<p>This creates the ref for react to, well, reference. This is kind of like declaring your variable. </p>\n<p>Next, I'll place the ref on the input element:\n<code>ref={this.formSubmitRef}</code></p>\n<p>As a whole, it'll look something like this:  </p>\n<pre><code class=\"language-javascript\">&#x3C;input\n  ref={this.formSubmitRef}\n  style={Styles.pretendAnchorTag}\n  onMouseOver={() => {\n      this.formSubmitRef.current.style.color = '#0000FF'\n      }}\n  onMouseLeave={() => {\n      this.formSubmitRef.current.style.color = '#212529'\n      }}\n  type=\"submit\"\n  value=\"View Property Statements List\"\n  name=\"DFH_ENTER\"\n/>\n</code></pre>\n<p>As you can see, in order to reference this actual input, we refer to <code>this.formSubmitRef.current</code>\nThe <code>.current</code> refers the current state of that element. </p>\n<p>And thats basically it, the new way to use React Refs. </p>\n<h2>Just the Code</h2>\n<pre><code class=\"language-javascript\">this.formSubmitRef = React.createRef();\n</code></pre>\n<pre><code class=\"language-javascript\">ref={this.formSubmitRef}\n</code></pre>\n<pre><code class=\"language-javascript\">onMouseOver={() => {\n      this.formSubmitRef.current.style.color = '#0000FF'\n      }}\n</code></pre>","frontmatter":{"title":"Using React Refs to Style Input Type Submit"}}},"pageContext":{"slug":"/blog/react-refs/"}}